apemangr/Repetidor-nRF52-SDK-17.1.0/main.c
    if (err_code != NRF_SUCCESS) {
        NRF_LOG_ERROR("UART initialization failed with error: 0x%X", err_code);
        // No hacer crash, continuar sin UART
        return;
    }
    // NRF_LOG_INFO("UART initialized successfully");
}

void rtc_handler(nrfx_rtc_int_type_t int_type)
{
    if (int_type == NRFX_RTC_INT_COMPARE0) {
        m_rtc_on_flag = true;
    }

    else if (int_type == NRFX_RTC_INT_COMPARE1) {
        m_rtc_sleep_flag = true;
    }

    else if (int_type == NRFX_RTC_INT_COMPARE2) {
        calendar_rtc_handler();
    }
}

void handle_rtc_events(void)
{
    ret_code_t err_code;

    if (m_rtc_on_flag) {
        m_rtc_on_flag = false;

        if (m_device_active) {
            disconnect_all_devices();
            advertising_stop();
            scan_stop();
            app_uart_close();

            nrf_gpio_pin_clear(LED1_PIN);

            m_device_active = false;

            if (!m_connected_this_cycle) {
                NRF_LOG_RAW_INFO(
                           "\n" LOG_INFO " Transicion a \033[1;36mMODO SLEEP "
                           "EXTENDIDO\033[0m");
                uint32_t extended_on_ms = read_time_from_flash(
                           TIEMPO_EXTENDED_ENCENDIDO,
                           DEFAULT_DEVICE_EXTENDED_ON_TIME_MS);
                uint32_t extended_sleep_ms = read_time_from_flash(
                           TIEMPO_EXTENDED_SLEEP,
                           DEFAULT_DEVICE_EXTENDED_SLEEP_TIME_MS);
                NRF_LOG_RAW_INFO(
                           LOG_INFO
                           " Modo extendido ACTIVADO (ON=%u ms, SLEEP=%u ms)",
                           extended_on_ms,
                           extended_sleep_ms);
                m_extended_mode_on = true;
                restart_extended_sleep_rtc();
            }
            else {
                NRF_LOG_RAW_INFO(
                           "\n" LOG_INFO
                           " Transicion a \033[1;36mMODO SLEEP\033[0m");
                uint32_t on_ms = read_time_from_flash(
                           TIEMPO_ENCENDIDO,
                           DEFAULT_DEVICE_ON_TIME_MS);
                uint32_t sleep_ms = read_time_from_flash(
                           TIEMPO_SLEEP,
                           DEFAULT_DEVICE_SLEEP_TIME_MS);
                NRF_LOG_RAW_INFO(
                           LOG_INFO " Modo normal (ON=%u ms, SLEEP=%u ms)",
                           on_ms,
                           sleep_ms);
                m_extended_mode_on = false;
                restart_sleep_rtc();
            }

            m_connected_this_cycle = false;
        }
    }

    if (m_rtc_sleep_flag) {
        m_rtc_sleep_flag = false;

        if (!m_device_active) {
            nrf_gpio_pin_set(LED1_PIN);

            if (m_extended_mode_on) {
                NRF_LOG_RAW_INFO(
                           "\n" LOG_INFO " Transicion a \033[1;32mMODO ACTIVO "
                           "EXTENDIDO\033[0m");
            }
            else {
                NRF_LOG_RAW_INFO(
                           "\n" LOG_INFO
                           " Transicion a \033[1;32mMODO ACTIVO\033[0m");
            }

            save_config_to_flash(&config_repeater);
            NRF_LOG_RAW_INFO(
                       LOG_OK
                       " Guardado de fecha y hora actual: %02u/%02u/%04u, "
                       "%02u:%02u:%02u",
                       m_time.day,
                       m_time.month,
                       m_time.year,
                       m_time.hour,
                       m_time.minute,
                       m_time.second);

            advertising_init();

            // Actualizar el payload para mostrar los adc_values
            scan_start();
            advertising_start();
            uart_init();
            m_device_active        = true;
            m_connected_this_cycle = false;

            if (m_extended_mode_on) {
                restart_extended_on_rtc();
            }
            else {
                restart_on_rtc();
            }
        }
    }
}

void rtc_init(void)
{
    // Configuración LFCLK mejorada
    nrf_drv_clock_init();
    nrf_drv_clock_lfclk_request(NULL);

    // Esperar a que el reloj esté estable
    while (!nrf_drv_clock_lfclk_is_running()) {
    }

    // Configurar RTC con prescaler CORRECTO
    nrfx_rtc_config_t config = NRFX_RTC_DEFAULT_CONFIG;
    config.prescaler         = RTC_PRESCALER;
    ret_code_t err_code      = nrfx_rtc_init(&m_rtc, &config, rtc_handler);
    APP_ERROR_CHECK(err_code);

    // Limpiar contador y comenzar desde cero
    nrfx_rtc_counter_clear(&m_rtc);

    // Configurar comparadores iniciales
    ret_code_t on_ms = read_time_from_flash(
               TIEMPO_ENCENDIDO,
               DEFAULT_DEVICE_ON_TIME_MS);
    // Solo programar el primer evento de 15s
    nrfx_rtc_cc_set(&m_rtc, 0, (on_ms / 1000) * 8, true);

    // Deshabilitar el evento de 20s inicialmente
    nrfx_rtc_cc_disable(&m_rtc, 1);

    // Habilitar interrupciones
    nrfx_rtc_int_enable(
               &m_rtc,
               NRF_RTC_INT_COMPARE0_MASK | NRF_RTC_INT_COMPARE1_MASK |
                          NRF_RTC_INT_COMPARE2_MASK);
    nrfx_rtc_enable(&m_rtc);
    nrf_gpio_pin_set(LED1_PIN);
}

void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name)
{
    app_error_handler(0xDEADBEEF, line_num, p_file_name);
}

static void base_timer_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

static void ble_nus_chars_received_uart_print(
           uint8_t *p_data,
           uint16_t data_len)
{
    ret_code_t ret_val;

    NRF_LOG_DEBUG("Receiving data.");
    NRF_LOG_HEXDUMP_DEBUG(p_data, data_len);

    for (uint32_t i = 0; i < data_len; i++) {
        uint32_t timeout_counter = 0;
        do {
            ret_val = app_uart_put(p_data[i]);
            if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY)) {
                NRF_LOG_ERROR(
                           "app_uart_put failed for index 0x%04x, error: 0x%X",
                           i,
                           ret_val);
                // No hacer crash, solo salir del loop
                break;
            }

            // Timeout para evitar loops infinitos
            timeout_counter++;
            if (timeout_counter > 10000) {
                NRF_LOG_WARNING("UART timeout, skipping byte %d", i);
                break;
            }
        } while (ret_val == NRF_ERROR_BUSY);
    }
    if (p_data[data_len - 1] == '\r') {
        while (app_uart_put('\n') == NRF_ERROR_BUSY)
            ;
    }
    if (ECHOBACK_BLE_UART_DATA) {
        // Send data back to the peripheral.
        // Esta funcionalidad está deshabilitada para evitar loops
        /*
        do
        {
            ret_val = ble_nus_c_string_send(&m_ble_nus_c, p_data, data_len);
            if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY))
            {
                NRF_LOG_ERROR("Failed sending NUS message. Error 0x%x.",
        ret_val);
                // No hacer crash en caso de error
                break;
            }
        } while (ret_val == NRF_ERROR_BUSY);
        */
    }
}

static bool shutdown_handler(nrf_pwr_mgmt_evt_t event)
{
    ret_code_t err_code;

